import { PartQuestionType } from './types';

export const PART_QUESTION: Record<string, PartQuestionType[]> = {
  기획: [
    {
      question:
        '1. 34기 NOW SOPT 기획 파트에 지원하게 된 동기는 무엇이며, 기획 파트 활동을 통해 지원자님이 이루고자 하는 목표와 이를 달성하기 위한 액션플랜을 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '2. 협업 과정에서 리더 혹은 팔로워로서의 강점이 잘 드러났던 경험을 서술해 주시고, 해당 역할을 수행 해 내기 위해 한 노력과 그 결과에 대해 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '3. 최근 1년 이내로 머릿속으로만 생각하고 있던 계획을 행동으로 옮겨본 경험이 있나요? 만약 있다면 어떤 계획이었으며, 행동을 통해 어떤 성장을 이루어냈는지에 대해 구체적으로 서술해 주세요. 만약 없다면, 해당 계획을 행동으로 옮기기 위한 액션 플랜을 서술해 주세요. ',
      maxCount: 700,
      required: true,
    },
    {
      question: `4. 비즈니스는 명확한 고객 문제정의에서 시작합니다. 아래 링크에서 본인이 관심 있는 프로덕트 하나를 선정한 후, \n\n 1) 해당 서비스를 이용하는 고객의 문제를 행동 기반으로 정의하고\n 2) 서비스의 어떤 점이 고객이 자연스럽게 공감하고 설득되는 부분인지에 대해 구체적으로 서술해 주세요.`,
      maxCount: 700,
      required: true,
    },
  ],
  디자인: [
    {
      question:
        '1. (디자인)34기 NOW SOPT 기획 파트에 지원하게 된 동기는 무엇이며, 기획 파트 활동을 통해 지원자님이 이루고자 하는 목표와 이를 달성하기 위한 액션플랜을 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '2. (디자인)협업 과정에서 리더 혹은 팔로워로서의 강점이 잘 드러났던 경험을 서술해 주시고, 해당 역할을 수행 해 내기 위해 한 노력과 그 결과에 대해 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '3. (디자인)최근 1년 이내로 머릿속으로만 생각하고 있던 계획을 행동으로 옮겨본 경험이 있나요? 만약 있다면 어떤 계획이었으며, 행동을 통해 어떤 성장을 이루어냈는지에 대해 구체적으로 서술해 주세요. 만약 없다면, 해당 계획을 행동으로 옮기기 위한 액션 플랜을 서술해 주세요. ',
      maxCount: 700,
      required: true,
    },
    {
      question: `4. (디자인)`,
      maxCount: 700,
      required: true,
    },
  ],
  안드로이드: [
    {
      question:
        '1. (안드로이드)34기 NOW SOPT 기획 파트에 지원하게 된 동기는 무엇이며, 기획 파트 활동을 통해 지원자님이 이루고자 하는 목표와 이를 달성하기 위한 액션플랜을 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '2. (안드로이드)3협업 과정에서 리더 혹은 팔로워로서의 강점이 잘 드러났던 경험을 서술해 주시고, 해당 역할을 수행 해 내기 위해 한 노력과 그 결과에 대해 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '3. (안드로이드)3최근 1년 이내로 머릿속으로만 생각하고 있던 계획을 행동으로 옮겨본 경험이 있나요? 만약 있다면 어떤 계획이었으며, 행동을 통해 어떤 성장을 이루어냈는지에 대해 구체적으로 서술해 주세요. 만약 없다면, 해당 계획을 행동으로 옮기기 위한 액션 플랜을 서술해 주세요. ',
      maxCount: 700,
      required: true,
    },
  ],
  iOS: [
    {
      question:
        '1. (iOS)34기 NOW SOPT 기획 파트에 지원하게 된 동기는 무엇이며, 기획 파트 활동을 통해 지원자님이 이루고자 하는 목표와 이를 달성하기 위한 액션플랜을 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '2. (iOS)협업 과정에서 리더 혹은 팔로워로서의 강점이 잘 드러났던 경험을 서술해 주시고, 해당 역할을 수행 해 내기 위해 한 노력과 그 결과에 대해 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '3. (iOS)최근 1년 이내로 머릿속으로만 생각하고 있던 계획을 행동으로 옮겨본 경험이 있나요? 만약 있다면 어떤 계획이었으며, 행동을 통해 어떤 성장을 이루어냈는지에 대해 구체적으로 서술해 주세요. 만약 없다면, 해당 계획을 행동으로 옮기기 위한 액션 플랜을 서술해 주세요. ',
      maxCount: 700,
      required: true,
    },
  ],
  웹: [
    {
      question:
        '1. (WEB)34기 NOW SOPT 기획 파트에 지원하게 된 동기는 무엇이며, 기획 파트 활동을 통해 지원자님이 이루고자 하는 목표와 이를 달성하기 위한 액션플랜을 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '2. (WEB)협업 과정에서 리더 혹은 팔로워로서의 강점이 잘 드러났던 경험을 서술해 주시고, 해당 역할을 수행 해 내기 위해 한 노력과 그 결과에 대해 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '3. (WEB)최근 1년 이내로 머릿속으로만 생각하고 있던 계획을 행동으로 옮겨본 경험이 있나요? 만약 있다면 어떤 계획이었으며, 행동을 통해 어떤 성장을 이루어냈는지에 대해 구체적으로 서술해 주세요. 만약 없다면, 해당 계획을 행동으로 옮기기 위한 액션 플랜을 서술해 주세요. ',
      maxCount: 700,
      required: true,
    },
  ],
  서버: [
    {
      question:
        '1. (서버)34기 NOW SOPT 기획 파트에 지원하게 된 동기는 무엇이며, 기획 파트 활동을 통해 지원자님이 이루고자 하는 목표와 이를 달성하기 위한 액션플랜을 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '2. (서버)협업 과정에서 리더 혹은 팔로워로서의 강점이 잘 드러났던 경험을 서술해 주시고, 해당 역할을 수행 해 내기 위해 한 노력과 그 결과에 대해 구체적으로 서술해 주세요.',
      maxCount: 700,
      required: true,
    },
    {
      question:
        '3. (서버)최근 1년 이내로 머릿속으로만 생각하고 있던 계획을 행동으로 옮겨본 경험이 있나요? 만약 있다면 어떤 계획이었으며, 행동을 통해 어떤 성장을 이루어냈는지에 대해 구체적으로 서술해 주세요. 만약 없다면, 해당 계획을 행동으로 옮기기 위한 액션 플랜을 서술해 주세요. ',
      maxCount: 700,
      required: true,
    },
  ],
};
